{
    
  "lessoninfo":[

      {
        "img": "3Skills",
        "title": "Three Skills You Need To Know",
        "subheading": "Give, Enjoy, Invest learn three essential money skills",
        "lesson": "Money is a tool that needs to be mastered. Some are able to master it while others are enslaved by it. These three skills are essential for us to understand and keep rooted in our minds and heart to be able to truly enjoy life and become a master of money.\n\nGiving:\nGiving is an essential skill to have when it comes to money. Giving is not only helpful for the person receiving the blessing it is also helpful for you. God Loves a cheerful giver. Expecting nothing in return just simply serving someone else putting them above you and meeting a need. It also allows you to break free from greed and a love for money. Giving should be a natural part of our life not only with money but with our time and our skills that God has blessed us with. Lets Have a heart of compassion and be a light in the way that we give. \n\nEnjoy:\nMoney is meant to be enjoyed! You worked hard why not make some memories with some of your money. Take a trip, Go on an adventure, buy your favorite snack from time to time, treat yourself. There is no shame in spending some money on you.\n\nInvest:\nInvesting is a skill that is essential aswell. Being able to buy something that in turn will produce more money for you in the long term is always great. And in doing so you are able to leave an inheritance that can last generations. Many big name brands you know today are lastnames. Family businesses passed down from generation to generation. These people have left an inheritance that their childrens children can build off of. Why work from zero only to have your child do the same. Give them a better foundation for the future.\n\nThis video by Dave Ramsey explains the three money skills we should have. Check it out and have a blessed day!",
        "videolink": "https://www.youtube.com/watch?v=3m3-lMdIlJw"
      },{
       "img": "loveOfMoney",
       "title": "What is the Love of Money?",
       "subheading": "Learn about what the bible means in 1 Timothy 6:10, that speaks on the love of money being the root of all evil.",
       "lesson": "1 Timothy 6:10 - \"For the love of money is a root of all kinds of evil. Some people, eager for money, have wandered from the faith and pierced themselves with many griefs.\" \n\nWe need to examine our hearts and diagnose a bad case of love for money. God warns us heavily about having a love for money even saying that we have to choose to either serve God or money.Matthew 6:24 - \"No one can serve two masters. Either you will hate the one and love the other, or you will be devoted to the one and despise the other. You cannot serve both God and money.\"\n\nThis video by Craig Baileys financial seeds breaks down what the Love of money is in a great way. Check it out and have a blessed day!",
       "videolink": "https://www.youtube.com/watch?v=q-N1nApLeCY&t=47s"
     },{
       "img": "Freedom",
       "title": "How to achieve Financial Freedom",
       "subheading": "Learn how to acheive financial freedom biblically. Here's a hint \"Assets\"",
       "lesson": "Financial freedom starts when you understand the power of freedom and assets. There is great power in not being a slave to debt. There is power in being a cheerful giver with the blessings God gives to you. There is power in owning items that will make money for you rather then take money away from you. For example properties can be great Assets! That overtime can be passed down to the next generation in your family, rented for profit, or even provide shelter for those in need.\n\nI Challenge you to first become debt free if you are not already,then learn about great Assets to own, Save enough money to invest and go after it. Leave an inheritance for your children and your childrens children. And be a blessing to the loved ones around you.\n\nThis video by Craig Baileys financial seeds gives a great view on financial freedom through the bible. Check it out and have a blessed day!",
       "videolink": "https://www.youtube.com/watch?v=fMEIbDDEf94"
     },{
       "img": "Question",
       "title": "What to do with your Savings?",
       "subheading": "Learn about options you have with your savings",
       "lesson": "What structure do you have with your savings? Having an emergency fund is great and I believe having 3 months of expenses stored away is way better than one month. But what happens to the excess amount that comes in after you have reached that amount? There are options you have with this extra money that can make you extra money through investments! Homes, Stocks, Investing in your childs future in college, Investing in mission trips at your local church or place of worship to help further advance the Gospel.These are all great options and there are plenty more! But the main ingredient to this success is starting as soon as possible.\n\nHaving money in a traditional savings account does not help you in the long run due to inflation. Be in control of your money and allow it to work for you and produce fruits that can bless you and your family. But it starts with a plan.\n\nThis video by Craig Baileys financial seeds gives a great view on what to do with money in your savings account. Check it out and have a blessed day!",
       "videolink": "https://www.youtube.com/watch?v=97-NZ70jfmE"
     },{
       "img": "DebtFree",
       "title": "Become Debt Free!",
       "subheading": "Live the debt free lifestyle and break the bondages of debt",
       "lesson": "Proverbs 22:7 says, “The rich rule over the poor, and the borrower is slave to the lender”. Debt is slavery according to the bible. And it is true, having to owe money to someone else puts a strain and limit on your finances. Some debt is unavoidable such as health conditions, crazy life situations and college debt. But we should not put ourselves in shackles willingly. Change your view on debt and see it for what it is slavery not freedom. Before you go and max out your credit card knowing good and well you cant afford it. Think about the stress and chains you are intentionally throwing on yourself. Be content with what God has blessed you with and be a great steward with what you have.\n\nPatience and repetition of your budget month by month will produce the peace and freedom you are looking for. Just remember there are no shortcuts to a place worth going. Hard work and patience is the key. If your in debt currently and want to be set free you have to understand that there will be some pain in the process. In order to break free there has to be some things that you need to cut out of your spending habits. Maybe even items you hold dear need to be sold. The question is how bad do you want to be free and are you willing to endure the pain? James 1:2-4 says \"Consider it pure joy, my brothers, when you encounter trials of many kinds, because you know that the testing of your faith develops perseverance. Allow perseverance to finish its work, so that you may be mature and complete, not lacking anything\". I challenge you if you are in debt to fight for your financial freedom and allow perserverance to finish its work in you.\n\nThis video by Craig Baileys financial seeds gives a great view on what Debt really is and shares some scriptures that can help you on your journey to become debt free. Check it out and have a blessed day!",
       "videolink": "https://www.youtube.com/watch?v=cqcGj08uEmw&t=1s"
     }
  ]
  
}
